---
kind: method
id: M:Autodesk.Revit.DB.CompoundStructure.IsEqual(Autodesk.Revit.DB.CompoundStructure)
source: html/e42daee6-b3c8-3c65-d26c-3bbff6598479.htm
---
# Autodesk.Revit.DB.CompoundStructure.IsEqual Method

Checks whether this CompoundStructure is the same as another CompoundStructure.

## Syntax (C#)
```csharp
public bool IsEqual(
	CompoundStructure otherStructure
)
```

## Parameters
- **otherStructure** (`Autodesk.Revit.DB.CompoundStructure`) - A CompoundStructure.

## Returns
True if the two CompoundStructures are the same, and false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null